W6/ebay_devise/app/controllers/reviews_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1
INSERT INTO "reviews" ("description", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "test"], ["product_id", 1], ["created_at", "2016-03-08 17:05:33.209610"], ["updated_at", "2016-03-08 17:05:33.209610"]]
---
  def create
    @product = Product.find(params[:product_id])
    @review = @product.reviews.new(review_params)
    @user = User.find_by_email(params[:review][:user_id])

    if @review.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]
---
  def index
    @product = Product.find(params[:product_id])
    @review = @product.reviews.all